// 给定一个只包括 '('，')'，'{'，'}'，'['，']' 的字符串，判断字符串是否有效。
//
// 有效字符串需满足：
//
//
// 左括号必须用相同类型的右括号闭合。
// 左括号必须以正确的顺序闭合。
//
//
// 注意空字符串可被认为是有效字符串。
//
// 示例 1:
//
// 输入: "()"
// 输出: true
//
//
// 示例 2:
//
// 输入: "()[]{}"
// 输出: true
//
//
// 示例 3:
//
// 输入: "(]"
// 输出: false
//
//
// 示例 4:
//
// 输入: "([)]"
// 输出: false
//
//
// 示例 5:
//
// 输入: "{[]}"
// 输出: true
// Related Topics 栈 字符串
// 👍 1746 👎 0

bool isValid(char *s) {
    int top = -1;
    char stack[0x1000];

    while (*s) {
        if (*s == '(' || *s == '[' || *s == '{') {
            assert(top + 1 < 0x1000);
            stack[++top] = *s;
        } else if (top >= 0 && stack[top] == '(' && *s == ')') {
            top--;
        } else if (top >= 0 && stack[top] == '[' && *s == ']') {
            top--;
        } else if (top >= 0 && stack[top] == '{' && *s == '}') {
            top--;
        } else {
            return false;
        }
        s++;
    }
    return top == -1;
}