//给定一个正整数 n，将其拆分为至少两个正整数的和，并使这些整数的乘积最大化。 返回你可以获得的最大乘积。
//
// 示例 1:
//
// 输入: 2
//输出: 1
//解释: 2 = 1 + 1, 1 × 1 = 1。
//
// 示例 2:
//
// 输入: 10
//输出: 36
//解释: 10 = 3 + 3 + 4, 3 × 3 × 4 = 36。
//
// 说明: 你可以假设 n 不小于 2 且不大于 58。
// Related Topics 数学 动态规划
// 👍 293 👎 0

#define MAX_N 58
int pos = 4, data[MAX_N + 1] = { 0, 1, 1, 2 };

static int max(int a, int b) {
    return a > b ? a : b;
}

int integerBreak(int n) {
    if (n < pos) return data[n];

    for (; pos <= n; ++pos) {
        if (pos % 3 == 0) {
            data[pos] = max(data[pos - 3], pos - 3) * 3;
        } else {
            data[pos] = max(data[pos - 2], pos - 2) * 2;
        }
    }

    return data[n];
}