// 给定两个二叉树，编写一个函数来检验它们是否相同。
//
// 如果两个树在结构上相同，并且节点具有相同的值，则认为它们是相同的。
//
// 示例 1:
//
// 输入：       1         1
//            / \       / \
//           2   3     2   3
//
//          [1,2,3],   [1,2,3]
//
// 输出: true
//
// 示例 2:
//
// 输入:      1         1
//          /           \
//         2             2
//
//        [1,2],     [1,null,2]
//
// 输出: false
//
//
// 示例 3:
//
// 输入：      1         1
//           / \       / \
//          2   1     1   2
//
//         [1,2,1],   [1,1,2]
//
// 输出: false
//
// Related Topics 树 深度优先搜索
// 👍 413 👎 0\

bool isSameTree(struct TreeNode *t1, struct TreeNode *t2) {
    if (t1 == t2) return true;
    if (!t1 || !t2) return false;

    return t1->val == t2->val && isSameTree(t1->left, t2->left) && isSameTree(t1->right, t2->right);
}
