// 给你一个整数 n，请你每隔三位添加点（即 "." 符号）作为千位分隔符，并将结果以字符串格式返回。
//
//
//
// 示例 1：
//
// 输入：n = 987
// 输出："987"
//
//
// 示例 2：
//
// 输入：n = 1234
// 输出："1.234"
//
//
// 示例 3：
//
// 输入：n = 123456789
// 输出："123.456.789"
//
//
// 示例 4：
//
// 输入：n = 0
// 输出："0"
//
//
//
//
// 提示：
//
//
// 0 <= n < 2^31
//
// Related Topics 字符串 👍 12 👎 0

char *thousandSeparator(int n) {
    char *p;
    int ss[4] = { 0 }, len = 0;
    static char str[14] = { '\0' };

    for (; !len || n; ss[len++] = n % 1000, n /= 1000) {}
    p = str + sprintf(str, "%d", ss[len - 1]);
    for (int i = len - 2; i >= 0; i--) {
        *p++ = '.', p += sprintf(p, "%03d", ss[i]);
    }

    return str;
}