// 给你一个整数 n ，以二进制字符串的形式返回该整数的 负二进制（base -2）表示。
//
// 注意，除非字符串就是 "0"，否则返回的字符串中不能含有前导零。
//
//
//
// 示例 1：
//
//
// 输入：n = 2
// 输出："110"
// 解释：(-2)² + (-2)¹ = 2
//
//
// 示例 2：
//
//
// 输入：n = 3
// 输出："111"
// 解释：(-2)² + (-2)¹ + (-2)⁰ = 3
//
//
// 示例 3：
//
//
// 输入：n = 4
// 输出："100"
// 解释：(-2)² = 4
//
//
//
//
// 提示：
//
//
// 0 <= n <= 10⁹
//
//
// Related Topics 数学 👍 110 👎 0

#define MAXN 32
char *baseNeg2(int n) {
    if (!n) return "0";
    int len               = MAXN - 1;
    static char str[MAXN] = { '\0' };
    for (bool flag = false; n; flag = !flag, n /= 2) {
        str[--len] = n % 2 + '0';
        if (flag && n % 2) n += 2;
    }
    return str + len;
}
